---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemCutLength
source: html/2dda2ade-b48b-c20c-2b78-5b4eba7b0267.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemCutLength Property

"Cut Length"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemCutLength { get; }
```